<a href='https://i.ibb.co/TPq9FfH/Nilakantha-Singh-Deo.jpg'> <img src='https://i.ibb.co/TPq9FfH/Nilakantha-Singh-Deo.jpg' /></a>

<a href='https://i.ibb.co/FDBwTkh/groupby.jpg'> <img src='https://i.ibb.co/FDBwTkh/groupby.jpg' /></a>

In [64]:
%%HTML
<style type="text/css">
table.dataframe td, table.dataframe th {
    border: 1px  black solid !important;
  color: black !important;
}
</style>

In [3]:
import numpy as np
import pandas as pd

In [20]:
#Create a dataframe
data={'Company':["Google","Google","MSoft","MSoft","MSoft","FB","FB"],'Person':["Alex","Mia","Dambaru","PD","Rocky","Seli G","Tikira"],'Sales':[100,200,121,333,522,45,67]}
df=pd.DataFrame(data)
df

  Company   Person  Sales
0  Google     Alex    100
1  Google      Mia    200
2   MSoft  Dambaru    121
3   MSoft       PD    333
4   MSoft    Rocky    522
5      FB   Seli G     45
6      FB   Tikira     67

In [19]:
#run groupby on Company column
byComp=df.groupby('Company')
byComp

In [11]:
#Get the mean
byComp.mean()
#non numeric values dont have mean

              Sales
Company
FB        56.000000
Google   150.000000
MSoft    325.333333

In [16]:
standardDev=byComp.std() 

SumofSales=byComp.sum()

In [33]:
#Get sum of sales for Facebook
byComp=df.groupby('Company')
print(byComp)
sumSales=byComp.sum().loc['FB']
print(sumSales)

#Alternatively
df.groupby('Company').sum().loc['FB']

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000231CA351D88>
Sales    112
Name: FB, dtype: int64

Sales    112
Name: FB, dtype: int64

In [43]:
desc=df.groupby('Company').describe()
print(desc)
df.groupby('Company').describe().transpose()

        Sales
        count        mean         std    min    25%    50%    75%    max
Company
FB        2.0   56.000000   15.556349   45.0   50.5   56.0   61.5   67.0
Google    2.0  150.000000   70.710678  100.0  125.0  150.0  175.0  200.0
MSoft     3.0  325.333333  200.609903  121.0  227.0  333.0  427.5  522.0

Company             FB      Google       MSoft
Sales count   2.000000    2.000000    3.000000
      mean   56.000000  150.000000  325.333333
      std    15.556349   70.710678  200.609903
      min    45.000000  100.000000  121.000000
      25%    50.500000  125.000000  227.000000
      50%    56.000000  150.000000  333.000000
      75%    61.500000  175.000000  427.500000
      max    67.000000  200.000000  522.000000

In [44]:
#For a single company
df.groupby('Company').describe().transpose()['FB']

Sales  count     2.000000
       mean     56.000000
       std      15.556349
       min      45.000000
       25%      50.500000
       50%      56.000000
       75%      61.500000
       max      67.000000
Name: FB, dtype: float64

In [46]:
#get the min or max value
df.groupby('Company').min()

          Person  Sales
Company
FB        Seli G     45
Google      Alex    100
MSoft    Dambaru    121